MikroElektronika/core_packages/ARM/gcc_clang/def/sam/ATSAMV71J20A/mcu.h
  PERIPH_COUNT_IRQn        = 69  /**< Number of peripheral IDs */
} IRQn_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef struct _DeviceVectors
{
  /* Stack pointer */
  void* pvStack;
  /* Cortex-M handlers */
  void* pfnReset_Handler;                        /* -15 Reset Vector, invoked on Power up and warm reset  */
  void* pfnNonMaskableInt_Handler;               /* -14 Non maskable Interrupt, cannot be stopped or preempted  */
  void* pfnHardFault_Handler;                    /* -13 Hard Fault, all classes of Fault     */
  void* pfnMemoryManagement_Handler;             /* -12 Memory Management, MPU mismatch, including Access Violation and No Match  */
  void* pfnBusFault_Handler;                     /* -11 Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory related Fault  */
  void* pfnUsageFault_Handler;                   /* -10 Usage Fault, i.e. Undef Instruction, Illegal State Transition  */
  void* pvReservedC9;
  void* pvReservedC8;
  void* pvReservedC7;
  void* pvReservedC6;
  void* pfnSVCall_Handler;                       /*  -5 System Service Call via SVC instruction  */
  void* pfnDebugMonitor_Handler;                 /*  -4 Debug Monitor                        */
  void* pvReservedC3;
  void* pfnPendSV_Handler;                       /*  -2 Pendable request for system service  */
  void* pfnSysTick_Handler;                      /*  -1 System Tick Timer                    */


  /* Peripheral handlers */
  void* pfnSUPC_Handler;                         /* 0   SAMV71J20 Supply Controller (SUPC) */
  void* pfnRSTC_Handler;                         /* 1   SAMV71J20 Reset Controller (RSTC) */
  void* pfnRTC_Handler;                          /* 2   SAMV71J20 Real-time Clock (RTC) */
  void* pfnRTT_Handler;                          /* 3   SAMV71J20 Real-time Timer (RTT) */
  void* pfnWDT_Handler;                          /* 4   SAMV71J20 Watchdog Timer (WDT) */
  void* pfnPMC_Handler;                          /* 5   SAMV71J20 Power Management Controller (PMC) */
  void* pfnEFC_Handler;                          /* 6   SAMV71J20 Embedded Flash Controller (EFC) */
  void* pfnUART0_Handler;                        /* 7   SAMV71J20 Universal Asynchronous Receiver Transmitter (UART0) */
  void* pfnUART1_Handler;                        /* 8   SAMV71J20 Universal Asynchronous Receiver Transmitter (UART1) */
  void* pvReserved9;
  void* pfnPIOA_Handler;                         /* 10  SAMV71J20 Parallel Input/Output Controller (PIOA) */
  void* pfnPIOB_Handler;                         /* 11  SAMV71J20 Parallel Input/Output Controller (PIOB) */
  void* pvReserved12;
  void* pfnUSART0_Handler;                       /* 13  SAMV71J20 Universal Synchronous Asynchronous Receiver Transmitter (USART0) */
  void* pfnUSART1_Handler;                       /* 14  SAMV71J20 Universal Synchronous Asynchronous Receiver Transmitter (USART1) */
  void* pvReserved15;
  void* pfnPIOD_Handler;                         /* 16  SAMV71J20 Parallel Input/Output Controller (PIOD) */
  void* pvReserved17;
  void* pfnHSMCI_Handler;                        /* 18  SAMV71J20 High Speed MultiMedia Card Interface (HSMCI) */
  void* pfnTWIHS0_Handler;                       /* 19  SAMV71J20 Two-wire Interface High Speed (TWIHS0) */
  void* pfnTWIHS1_Handler;                       /* 20  SAMV71J20 Two-wire Interface High Speed (TWIHS1) */
  void* pvReserved21;
  void* pfnSSC_Handler;                          /* 22  SAMV71J20 Synchronous Serial Controller (SSC) */
  void* pfnTC0_Handler;                          /* 23  SAMV71J20 Timer Counter (TC0)  */
  void* pfnTC1_Handler;                          /* 24  SAMV71J20 Timer Counter (TC0)  */
  void* pfnTC2_Handler;                          /* 25  SAMV71J20 Timer Counter (TC0)  */
  void* pfnTC3_Handler;                          /* 26  SAMV71J20 Timer Counter (TC1)  */
  void* pfnTC4_Handler;                          /* 27  SAMV71J20 Timer Counter (TC1)  */
  void* pfnTC5_Handler;                          /* 28  SAMV71J20 Timer Counter (TC1)  */
  void* pfnAFEC0_Handler;                        /* 29  SAMV71J20 Analog Front-End Controller (AFEC0) */
  void* pfnDACC_Handler;                         /* 30  SAMV71J20 Digital-to-Analog Converter Controller (DACC) */
  void* pfnPWM0_Handler;                         /* 31  SAMV71J20 Pulse Width Modulation Controller (PWM0) */
  void* pfnICM_Handler;                          /* 32  SAMV71J20 Integrity Check Monitor (ICM) */
  void* pfnACC_Handler;                          /* 33  SAMV71J20 Analog Comparator Controller (ACC) */
  void* pfnUSBHS_Handler;                        /* 34  SAMV71J20 USB High-Speed Interface (USBHS) */
  void* pfnMCAN0_INT0_Handler;                   /* 35  SAMV71J20 Controller Area Network (MCAN0) */
  void* pfnMCAN0_INT1_Handler;                   /* 36  SAMV71J20 Controller Area Network (MCAN0) */
  void* pvReserved37;
  void* pvReserved38;
  void* pfnGMAC_Handler;                         /* 39  SAMV71J20 Gigabit Ethernet MAC (GMAC) */
  void* pfnAFEC1_Handler;                        /* 40  SAMV71J20 Analog Front-End Controller (AFEC1) */
  void* pvReserved41;
  void* pvReserved42;
  void* pfnQSPI_Handler;                         /* 43  SAMV71J20 Quad Serial Peripheral Interface (QSPI) */
  void* pfnUART2_Handler;                        /* 44  SAMV71J20 Universal Asynchronous Receiver Transmitter (UART2) */
  void* pvReserved45;
  void* pvReserved46;
  void* pfnTC6_Handler;                          /* 47  SAMV71J20 Timer Counter (TC2)  */
  void* pfnTC7_Handler;                          /* 48  SAMV71J20 Timer Counter (TC2)  */
  void* pfnTC8_Handler;                          /* 49  SAMV71J20 Timer Counter (TC2)  */
  void* pfnTC9_Handler;                          /* 50  SAMV71J20 Timer Counter (TC3)  */
  void* pfnTC10_Handler;                         /* 51  SAMV71J20 Timer Counter (TC3)  */
  void* pfnTC11_Handler;                         /* 52  SAMV71J20 Timer Counter (TC3)  */
  void* pfnMLB_Handler;                          /* 53  SAMV71J20 MediaLB (MLB)        */
  void* pvReserved54;
  void* pvReserved55;
  void* pfnAES_Handler;                          /* 56  SAMV71J20 Advanced Encryption Standard (AES) */
  void* pfnTRNG_Handler;                         /* 57  SAMV71J20 True Random Number Generator (TRNG) */
  void* pfnXDMAC_Handler;                        /* 58  SAMV71J20 Extensible DMA Controller (XDMAC) */
  void* pfnISI_Handler;                          /* 59  SAMV71J20 Image Sensor Interface (ISI) */
  void* pfnPWM1_Handler;                         /* 60  SAMV71J20 Pulse Width Modulation Controller (PWM1) */
  void* pfnFPU_Handler;                          /* 61  SAMV71J20 Floating Point Unit (FPU) */
  void* pvReserved62;
  void* pfnRSWDT_Handler;                        /* 63  SAMV71J20 Reinforced Safety Watchdog Timer (RSWDT) */
  void* pvReserved64;
  void* pvReserved65;
  void* pfnGMAC_Q1_Handler;                      /* 66  SAMV71J20 Gigabit Ethernet MAC (GMAC) */
  void* pfnGMAC_Q2_Handler;                      /* 67  SAMV71J20 Gigabit Ethernet MAC (GMAC) */
  void* pfnIXC_Handler;                          /* 68  SAMV71J20 Floating Point Unit (FPU) */
} DeviceVectors;

/* Defines for Deprecated Interrupt and Exceptions handler names */
#define pfnMemManage_Handler      pfnMemoryManagement_Handler     /**< \deprecated  Backward compatibility for ASF */
#define pfnDebugMon_Handler       pfnDebugMonitor_Handler         /**< \deprecated  Backward compatibility for ASF */
#define pfnNMI_Handler            pfnNonMaskableInt_Handler       /**< \deprecated  Backward compatibility for ASF */
#define pfnSVC_Handler            pfnSVCall_Handler               /**< \deprecated  Backward compatibility for ASF */

